import re
import time
import const
from module.command import command

if __name__ == '__main__':

    comm_list = [
        "小航，打开卧室空调。",
        "打开卧室A空调。",
        "打开卧室A的空调。",
        "打开A卧室的空调。",
        "打开卧室1的空调。",
        "打开卧室的空调。",
        "把卧室的空调调节到26度。",
        "卧室空调设置成26。",
        "小航，卧室空调设置成26。",
        "小航，卧室空调设置26。",
        "卧室空调设置成制冷模式。",
        "卧室空调设置制冷模式。",
        "卧室空调设置成KTV模式。",
        "把卧室的空调调节到26。",
        "把卧室的空调调整到26。",
        "小航，把卧室的电视设置成关机。",
        "小航，把卧室的电视设置成打开。",
        "小航，把卧室的电视设置成打开状态。",
        "小航，把卧室的电视设置待机。",
        "小航，把卧室的电饭煲设置保温。",
        "小航，把卧室的电视设置成待机。",
        "小航，把卧室的电视设置成待机状态。",
        "把卧室的空调调整成为26。",
        "小航，把卧室的空调调整到26。",
        "小航，把卧室空调调整到26。",
        "小航，卧室空调调整到26。",
        "卧室空调调整到26。",
        "把厨房的空调调整到排风模式。",
        "把卧室的灯调整到浪漫模式。",
        "把卧室的灯调整到学习模式。",
        "把卧室的灯设置成普通模式。",
        "小航，把卧室的灯设置成普通模式。",
        "打开卧室A一号空调。",
        "打开A卧室的立式空调。",
        "打开A卧室的A空调。",
        "打开A卧室的一号空调。",
        "打开A卧室一号空调。",
        "打开A卧室的空调1。",
        "打开A卧室的空调A。",
        "打开卧室的空调。",
        "卧室的空调关闭。",
        "关闭卧室的空调"
    ]

    comm_list3 = [
        "打开卧室的电视。",
        "设置卧室空调温度成26。",
        "设置卧室的电视为打开。"
    ]

    comm_list = [
        "卧室的空调关闭。",
        "关闭卧室的空调"
    ]
    for comm in comm_list:
        time.sleep(2)
        # 指令解析
        cmd = command.Command(comm)