# 房间信息
LIVINGROOM = "客厅"
BEDROOM = "卧室"
TOILET = "厕所"

# aip账号信息
appid = '26014792'
apikey = 'a4PRCsuuOtsVBl9EI65sjA4M'
secretkey = 'ivGuy1Th9z8vSqWZuVNgL8eVVCMyMH9e'

# 指令解析 Client Auth Conf
AIP_NLP_APP_ID = '26151281'
AIP_NLP_API_KEY = 'zMwqAxoQ2x7eu5UGGkyQYkoD'
AIP_NLP_SECRET_KEY = 'jilRiqvgSk6VCFu0lbHFbIydFVrU2G9c'

# 家电列表
APPS = [
    "电视",
    "电灯",
    "空调"
]

# 可调节温度的家电
TEMP_APPS = [
    "空调"
]

# 房间列表
LOCATIONS = [
    "卧室",
    "客厅",
    "厨房",
    "卫生间",
    "阳台"
]

# action dict
ACTIONS = {
    "设置": "设置",
    "设定": "设置",
    "切换": "设置",
    "调节": "设置",
    "调换": "设置",
    "调整": "设置",

    "开启": "开启",
    "打开": "开启",
    "启动": "开启",
    "发动": "开启",

    "关闭": "关闭",
    "关机": "关闭",

    "暂停": "待机"
}

# scale dict
SCALES = {
    "电灯": {
        # 电源状态
        "开启": "开启",
        "开启状态": "开启",
        "启动": "开启",
        "启动状态": "开启",
        "开机": "开启",
        "开机状态": "开启",
        "打开": "开启",
        "打开状态": "开启",

        "关闭": "关闭",
        "关闭状态": "关闭",
        "关机": "关闭",
        "关机状态": "关闭",

        "待机": "待机",
        "待机状态": "待机",
        "睡眠": "待机",
        "睡眠状态": "待机",

        # 工作模式
        "阅读": "阅读模式",
        "阅读模式": "阅读模式",
        "写作": "写作模式",
        "写作模式": "写作模式",
        "观影": "观影模式",
        "观影模式": "观影模式",
        "轰趴": "轰趴模式",
        "轰趴模式": "轰趴模式",
        "自动": "自动模式",
        "自动模式": "自动模式"
    },
    "电视": {
        # 电源状态
        "开启": "开启",
        "开启状态": "开启",
        "启动": "开启",
        "启动状态": "开启",
        "开机": "开启",
        "开机状态": "开启",
        "打开": "开启",
        "打开状态": "开启",

        "关闭": "关闭",
        "关闭状态": "关闭",
        "关机": "关闭",
        "关机状态": "关闭",

        "待机": "待机",
        "待机状态": "待机",
        "睡眠": "待机",
        "睡眠状态": "待机"
    },
    "空调": {
        # 电源状态
        "开启": "开启",
        "开启状态": "开启",
        "启动": "开启",
        "启动状态": "开启",
        "开机": "开启",
        "开机状态": "开启",
        "打开": "开启",
        "打开状态": "开启",

        "关闭": "关闭",
        "关闭状态": "关闭",
        "关机": "关闭",
        "关机状态": "关闭",

        "待机": "待机",
        "待机状态": "待机",
        "睡眠": "待机",
        "睡眠状态": "待机",

        # 工作模式
        "制冷": "制冷",
        "制冷模式": "制冷",
        "制热": "制热",
        "制热模式": "制热",
        "除湿": "除湿",
        "除湿模式": "除湿",
        "通风": "通风",
        "通风模式": "通风",
        "自动": "自动",
        "自动模式": "自动"
    }
}

# 依存关系
# 词性
POS = {
    "a": "形容词",
    "ad": "副形词",
    "ag": "形语素",
    "an": "名形词",
    "b": "区别词",
    "c": "连词",
    "d": "副词",
    "dg": "副语素",
    "e": "叹词",
    "f": "方位名词",
    "g": "语素",
    "h": "前接成分",
    "i": "成语",
    "j": "简称略语",
    "k": "后接成分",
    "l": "习惯语",
    "m": "数量词",
    "n": "普通名词",
    "ng": "名语素",
    "nr": "人名",
    "ns": "地名",
    "nt": "机构团体名",
    "nw": "作品名",
    "nz": "其他专名",
    "o": "拟声词",
    "p": "介词",
    "q": "量词",
    "r": "代词",
    "s": "处所名词",
    "t": "时间名词",
    "tg": "时语素",
    "u": "助词",
    "un": "未知词",
    "v": "普通动词",
    "vd": "动副词",
    "vg": "动语素",
    "vn": "动名词",
    "w": "标点符号",
    "x": "非语素字",
    "xc": "其他虚词",
    "y": "语气词",
    "z": "状态词",
    "PER": "人名",
    "LOC": "地名",
    "ORG": "机构名",
    "TIME": "时间",
    "": "/"
}
# 专有名词
NE = {
    "PER": "人名",
    "LOC": "地名",
    "ORG": "机构名",
    "TIME": "时间",
    "": "/"
}
# 依存关系
DEPRE = {
    "SBV": "主谓关系",
    "VOB": "动宾关系",
    "POB": "介宾关系",
    "ADV": "状中关系",
    "CMP": "动补关系",
    "ATT": "定中关系",
    "F": "方位关系",
    "COO": "并列关系",
    "DBL": "兼语结构",
    "DOB": "双宾语结构",
    "VV": "连谓结构",
    "IC": "子句结构",
    "MT": "虚词成分",
    "HED": "核心关系",
    "": ""
}